Documents/КомпенсацияОдежда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КомпенсацияОдежда</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыплатыЛьготникам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МесяцВыплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебныйГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обучающиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Родители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обучающийся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Классы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдостоверениеМногодетныхНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокДействия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КомпенсацияОдежда/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВыплатыЛьготникам Приход
	Движения.ВыплатыЛьготникам.Записывать = Истина;
	Для Каждого ТекСтрокаОбучающиеся Из Обучающиеся Цикл
		Движение = Движения.ВыплатыЛьготникам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = МесяцВыплаты;
		Движение.Обучающийся = ТекСтрокаОбучающиеся.Обучающийся;
		Движение.Родитель = ТекСтрокаОбучающиеся.Родитель;
		Движение.ТипВыплаты = Перечисления.ПереченьЛьгот.КомпенсацияЗаОдежду;
		Движение.УчебныйГод = УчебныйГод;
		Движение.Сумма = ТекСтрокаОбучающиеся.Сумма;
		Движение.РасчетныйСчет = ТекСтрокаОбучающиеся.РасчетныйСчет;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
